tap "adoptopenjdk/openjdk"
tap "d12frosted/emacs-plus"
tap "dart-lang/dart"
tap "gcenx/wine"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "michaeleisel/zld"
tap "mongodb/brew"
tap "railwaycat/emacsmacport"
tap "rigellute/tap"
tap "zegervdv/zathura"
brew "glib"
brew "python@3.9"
brew "gdk-pixbuf"
brew "harfbuzz"
brew "pango"
brew "librsvg"
brew "adwaita-icon-theme"
brew "python-tabulate"
brew "anime-downloader"
brew "webp"
brew "aom"
brew "arduino-cli"
brew "python@3.10"
brew "asciinema"
brew "atk"
brew "automake"
brew "bash"
brew "bat"
brew "bats"
brew "cc65"
brew "gcc"
brew "tbb"
brew "cmake"
brew "cocoapods"
brew "coreutils"
brew "dfu-programmer"
brew "dfu-util"
brew "folly"
brew "exercism"
brew "fizz"
brew "wangle"
brew "fbthrift"
brew "fb303"
brew "fd"
brew "libtool"
brew "guile"
brew "libidn2"
brew "gnutls"
brew "little-cms2"
brew "gobject-introspection"
brew "tesseract"
brew "ffmpeg"
brew "ffmpeg@4"
brew "open-mpi"
brew "fnm"
brew "fzf"
brew "gcc@11"
brew "git-lfs"
brew "glow"
brew "glslviewer"
brew "gnu-prolog"
brew "gnupg"
brew "go"
brew "gradle"
brew "gsettings-desktop-schemas"
brew "gtk+3"
brew "hdf5"
brew "lua"
brew "highlight"
brew "http-server"
brew "httpie"
brew "jasper"
brew "libheif"
brew "python@3.8"
brew "imagemagick"
brew "io"
brew "jenv"
brew "openjdk"
brew "leiningen"
brew "libgsf"
brew "libmatio"
brew "libnotify"
brew "libproxy"
brew "llvm"
brew "luarocks"
brew "lynx"
brew "mas"
brew "mecab"
brew "ninja"
brew "meson"
brew "mono", link: false
brew "yt-dlp"
brew "mpv"
brew "n"
brew "neofetch"
brew "neovim", args: ["HEAD"]
brew "nghttp2"
brew "nnn"
brew "pyqt@5"
brew "vtk"
brew "opencv"
brew "openjdk@11"
brew "openslide"
brew "pacvim"
brew "pandoc"
brew "tree"
brew "pass"
brew "poppler"
brew "postgresql@14"
brew "qt"
brew "pyqt"
brew "python@2", link: false
brew "qemu"
brew "ruby-build"
brew "rbenv"
brew "ripgrep"
brew "rlwrap"
brew "ruby"
brew "sbt"
brew "scala"
brew "sip"
brew "sphinx-doc"
brew "starship"
brew "tmux"
brew "vim"
brew "vips"
brew "watchman"
brew "wifi-password"
brew "yarn"
brew "ykman"
brew "youtube-dl"
brew "zlib"
brew "zsh-autosuggestions"
brew "d12frosted/emacs-plus/emacs-plus@27"
brew "dart-lang/dart/dart"
brew "heroku/brew/heroku", link: false
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "michaeleisel/zld/zld", link: false
brew "mongodb/brew/mongodb-community"
brew "railwaycat/emacsmacport/emacs-mac"
brew "rigellute/tap/spotify-tui"
brew "zegervdv/zathura/girara"
brew "zegervdv/zathura/zathura", args: ["HEAD"]
brew "zegervdv/zathura/zathura-pdf-poppler"
cask "1password"
cask "adoptopenjdk8"
cask "alacritty"
cask "appcleaner"
cask "balenaetcher"
cask "bettertouchtool"
cask "betterzip"
cask "caffeine"
cask "cheatsheet"
cask "dash"
cask "discord"
cask "docker"
cask "firefox"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "insomnia"
cask "java11"
cask "keepassxc"
cask "keybase"
cask "keycastr"
cask "logseq"
cask "mactex-no-gui"
cask "ngrok"
cask "nordvpn"
cask "notion"
cask "obsidian"
cask "paparazzi"
cask "parallels"
cask "principle"
cask "qbittorrent"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"
cask "qutebrowser"
cask "raycast"
cask "slack"
cask "spotify"
cask "suspicious-package"
cask "unofficial-wineskin"
cask "webpquicklook"
cask "zulu11"
