cask_args appdir: "/Applications"

# Taps
tap "adoptopenjdk/openjdk"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "koekeishiya/formulae"
tap "rigellute/tap"

# Mac App Store
brew "mas"

mas "Keynote", id: 409183694
mas "Magnet", id: 441258766
mas "Xcode", id: 497799835

# Apps
cask "adobe-creative-cloud"
cask "adoptopenjdk8"
cask "alfred"
cask "appcleaner"
cask "beaker-browser"
cask "caffeine"
cask "cheatsheet"
cask "docker"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "forklift"
cask "github"
cask "google-chrome"
cask "iterm2"
cask "java11"
cask "keybase"
cask "mactex-no-gui"
cask "ngrok"
cask "nordvpn"
cask "obsidian"
cask "processing"
cask "slack"
cask "spotify"
cask "tor-browser"
cask "ubersicht"
cask "visual-studio-code"

# Apps/Quicklook
cask "betterzip"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"
cask "suspicious-package"
cask "webpquicklook"

# Binaries
brew "automake"
brew "bash"
brew "bat"
brew "openssl@1.1"
brew "cmake"
brew "coreutils"
brew "curl"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "git"
brew "git-lfs"
brew "glslviewer"
brew "gnu-prolog"
brew "gnupg"
brew "gradle"
brew "grep"
brew "eslint"
brew "icu4c"
brew "imagemagick"
brew "jenv"
brew "leiningen"
brew "libtool"
brew "mas"
brew "mono"
brew "n"
brew "neovim", args: ["HEAD"]
brew "nnn"
brew "node"
brew "openssl@1.1"
brew "pandoc"
brew "pass"
brew "postgresql"
brew "ruby-build"
brew "rbenv"
brew "rlwrap"
brew "ruby"
brew "sbt"
brew "scala"
brew "tmux"
brew "tree"
brew "vim"
brew "vips"
brew "wifi-password"
brew "yarn"
brew "youtube-dl"
brew "zlib"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "heroku/brew/heroku"
brew "koekeishiya/formulae/yabai"
brew "koekeishiya/formulae/skhd"
brew "rigellute/tap/spotify-tui"
