tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
brew "xz"
brew "aom"
brew "bash"
brew "openssl@3"
brew "bat"
brew "btop"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "git-delta"
brew "lpeg"
brew "lua"
brew "luarocks"
brew "mecab"
brew "mise"
brew "readline"
brew "sqlite"
brew "yt-dlp"
brew "mpv"
brew "ncurses"
brew "ripgrep"
brew "nb"
brew "neofetch"
brew "neovim", args: ["HEAD"]
brew "pyenv"
brew "starship"
brew "stow"
brew "stylua"
brew "tcl-tk"
brew "tmux"
brew "tree"
brew "wifi-password"
brew "zlib"
cask "adobe-creative-cloud"
cask "alt-tab"
cask "altserver"
cask "anki"
cask "calibre"
cask "cleanmymac"
cask "copilot"
cask "cycling74-max"
cask "discord"
cask "enjoyable"
cask "figma"
cask "firefox"
cask "flotato"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-inter"
cask "font-inter-tight"
cask "font-new-york"
cask "font-sf-mono"
cask "font-sf-pro"
cask "google-chrome"
cask "google-chrome-canary"
cask "keepassxc"
cask "linear-linear"
cask "logi-options-plus"
cask "mullvadvpn"
cask "nordvpn"
cask "notunes"
cask "obsidian"
cask "pocket-casts"
cask "qbittorrent"
cask "raycast"
cask "rectangle"
cask "safari-technology-preview"
cask "signal"
cask "sioyek"
cask "slack"
cask "spotify"
cask "syncthing"
cask "the-unarchiver"
cask "ticktick"
cask "tor-browser"
cask "wezterm"
cask "zoom"
cask "zotero-beta"
